37-rails-api-solo-pt2-post/plant_store/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
    def index
        plants = Plant.all

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        plant = Plant.find(params[:id])

INSERT INTO "plants" ("name", "light", "water", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Rose"], ["light", "lots of light"], ["water", "lots of water"], ["price", 1000000], ["created_at", "2021-01-27 17:58:16.447400"], ["updated_at", "2021-01-27 17:58:16.447400"]]
---
    def create
        plant = Plant.create(plant_params)