36-rails-api-solo-review/plants/plant_store/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
    def index
        plants = Plant.all

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        plant = Plant.find(params[:id])